# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
import math

lst = [2, 3, 4, 5, 6]
result_list = []

for i in range(math.ceil(len(lst) / 2)):
    result_list.append(lst[i] * lst[-(1 + i)])

print(f'{lst} - Исходный спиисок')
print(f'{result_list} - Произведение пар чисел списка')
